{
  "": {
    "language": "ru",
    "plural-forms": "nplurals=3; plural=(n%10==1 && n%100!=11 ? 0 : n%10>=2 && n%10<=4 && (n%100<12 || n%100>14) ? 1 : 2);",
    "comment": "IMPORTANT! This file is autogenerated from *.po file. Do not edit it directly."
  },
  "AboutPage\u0004Start": "Поехали",
  "HomePage\u0004kb-trainer": "kb-trainer",
  "HomePage\u0004section_concept": "<h2>Концепция</h2>\n\n<p>Задача этого тренажёра — предоставить возможность пользователю ознакомиться со своей клавиатурой. Он не навязывает вам никакой определённой концепции набора. В этом смысле он подходит как тем, кто желает набирать исключительно двумя пальцами, так и гостям с Альфа Центавра, с десятью пальцами на каждой из их трёх рук :)</p>\n\n<p>Чтобы привыкнуть к любой клавиатуре — необходимо нажать каждую клавишу некоторое количество раз, сознательно обращая своё внимание на это, чтобы руки «запомнили» её расположение на клавиатуре и впоследствии действовали на автомате.</p>\n\n<p>Тренажёр должен быть универсальным. Позволять тренироваться с любой клавиатурной раскладкой, любого языка на любой клавиатуре с любым расположением клавиш и по любой методике.</p>",
  "HomePage\u0004section_congratulations": "<p>Удачи! Все <a href=\"https://github.com/smeagol74/kb-trainer/discussions\" target=\"_blank\">пожелания</a>/<a href=\"https://github.com/smeagol74/kb-trainer/issues\" target=\"_blank\">замечания</a>/<a href=\"https://github.com/smeagol74/kb-trainer/discussions\" target=\"_blank\">предложения</a> оставляйте на Гитхабе.</p>\n\n<p><a href=\"https://github.com/smeagol74/kb-trainer/pulls\" target=\"_blank\">Пул-реквесты</a> тоже приветствуются.</p>",
  "HomePage\u0004section_createdFor": "<h2>Для кого этот тренажёр создан</h2>\n\n<p>Он создан для всех, кто желает научиться более эффективно использовать свою клавиатуру. Кому приходится набирать много текстов, использовать много комбинаций клавиш. Со всеми её клавишами, включая клавиши переключатели (Shift, Control, Alt), клавиши перемещения и функциональные.</p>\n\n<p>Тренажёр ничего не знает про конфигурацию вашей клавиатуры или тренируемую раскладку, будь то классический ЙЦУКЕН или какой-нибудь специфический Бирман. Тренажёр подходит для любых вариантов.</p>",
  "HomePage\u0004section_history": "<h2>История идеи</h2>\n\n<p>Осенью 2020 года любимая жена подарила мне новую замечательную клавиатуру, вот такую:&nbsp;<a href=\"https://kinesis-ergo.com/shop/advantage2/\" target=\"_blank\">Kinesis Advantage 2</a> и тут незамедлительно выяснилось, что я не умею на ней работать. Буковки-то я ещё вспомнил как набирать, благо, метод слепой печати я освоил в своё время, но вот всё остальное оказалось очень сильно не на своих местах, Что уронило мою продуктивность практически в ноль. Я вновь ощутил себя человеком севшим за клавиатуру впервые в жизни. Так как я уже тренировался слепой печати, то решил просто обновить свои навыки на новой клавиатуре пройдя какой-нибудь известный курс. Нашёл какой-то тренажёр и даже начал нажимать буковки, но тут я понял, что тренажёр совершенно не занимается всякими служебными кнопочками. Тогда стал искать другие тренажёры и перепробовал многие, но результат был тот же. Пробел с вводом и переключатель строчных/прописных букв ещё как-то учитываются всеми этими многочисленными курсами, но множество прочих переключателей и расширенных знаков полностью игнорированы. Все обнаруженные мной тренажёры позволяют научиться набирать буковки, циферки и немного пунктуации. Но этого мало. И я задумал создать тренажёр, который позволит натренировать руки пользоваться всей клавиатурой целиком. Ведь кнопки Ввода, Контрола или Альта ничем не отличаются от кнопок с буковками. Из этого родилась концепция…</p>",
  "HomePage\u0004section_howItWorks": "<h2>Как это работает</h2>\n\n<p>Устройство тренажёра вытекает из основных принципов.</p>\n\n<ul>\n\n<li>Все символы/клавиши разбиты на группы, которые называются «Клавиатурами». Вы можете тренировать различные клавиатуры независимо друг от друга.</li>\n\n<li>Клавиатуры бывают пакетными и содержат символы/клавиши  из другию «клавиатур», например пакетная клавиатура «English» содержит в себе все английские знаки, цифры, пунктуацию и специальные клавиши.</li>\n\n<li>Тренировка «Клавиатуры» разбита на «уроки», которые тренируют какой-то набор символов/клавиш.</li>\n\n<li>Каждый «Урок» сначала тренирует только символы/клавиши этого урока (до определённого уровня), а затем подключает все уже пройденные уроки.</li>\n\n<li>Для тренировки урока, алгоритм случайным образом формирует текст тренировки учитывая всю предыдущую историю тренировок этой клавиатуры. Если во время тренировки вы сделали ошибку, то в последующих тренировка будет необходимо компенсировать её набрав ошибочный символ ещё заданное количество раз. Алгоритм старается добавлять символы/клавиши в текст так, чтобы вы нажимали их все примерно одинаково.</li>\n\n<li>Когда все уроки «пройдены», вы «застрянете» на последнем уроке с текстами состоящими из всех символов клавиатуры, пока не наберёте каждый символ заданное количество раз. За каждую ошибку от уже набранного количества будет отниматься заданное в настройках число. Чем больше вы делаете ошибок, тем больше будет попадаться ошибочный символ/клавиша в генерируемых текстах. Одновременно с этим тренажёр переключится в режим повышения скорости набора.  Автомат будет увеличивать скорость при безошичном прохождении уроков и уменьшать её в случае появления ошибок.</li>\n\n</ul>",
  "HomePage\u0004section_plans": "<h2>P.S. Планы</h2>\n\n<p>Вообще идей много. Хочется сделать возможность тренировки горячих клавиш. Причём как обычных клавиатурных аккордов, так и арпеджио, как в Vim или Emacs. Добавить возможность пользователям создавать свои собственные клавиатуры. Боюсь, что всякие диактитические знаки европейских языков приклеивающиеся к обычным английским символам сходу могут не заработать. Чего делать с восточными языками вроде китайского/японского вообще пока не понятно.</p>\n<p>Ещё я заметил, что мне интереснее тренироваться не под стук метронома, а под музыку. Например, диско даёт отличный ритм в диапазоне 100-130 ударов в минуту. И есть идея вместо метронома сделать диско-микс с возможностью плавной регулировки частоты ритма. Может синтезированная музыка подойдёт, пока не знаю.</p>",
  "HomePage\u0004section_principles": "<h2>Основные принципы</h2>\n\n<ul>\n<li>Чтобы привыкнуть к расположению клавиши, её нужно нажать много раз.</li>\n\n<li>Нажимать клавиши лучше без ошибок в удобном равномерном темпе.</li>\n\n<li>Развивать скорость нужно отдельно, когда пальцы привыкли к расположению клавиш.</li>\n\n<li>При нажатии комбинаций лучше по возможности использовать разные руки. Например, набирая заглавную букву клавишу <kbd>Shift</kbd> лучше нажимать другой рукой, чем буквенную клавишу.</li>\n</ul>",
  "HomePage\u0004section_specifics": "<h2>Специфика этого тренажёра</h2>\n\n<p>Этот тренажёр отличается от прочих тем, что позволяет тренировать и привыкать к расположению не только буквенно-цифровых знаков какой-то определённой раскладки и нескольких самых основных знаков препинания, но любых клавиш на вашей клавиатуре.</p>",
  "HomePage\u0004Start": "Поехали",
  "KeyboardPage\u0004Complete:": "Завершение:",
  "KeyboardPage\u0004Configuration of training completion and lessons switch criteria.": "Настройка завершения тренировок и критерия переключения уроков.",
  "KeyboardPage\u0004Count of errorless strokes of each key in the keyboard to consider keyboard training complete.": "Количество безошибочных нажатий каждой клавиши в клавиатуре, чтобы считать её натренированной.",
  "KeyboardPage\u0004Count of errorless strokes of each key in the lesson to consider the lesson is done and user can move forward.": "Количество безошибочных нажатий каждой клавиши в уроке, чтобы считать, что урок завершён и можно двигаться дальше.",
  "KeyboardPage\u0004Count of errorless strokes of keys in the lesson before adding already trained keys of keyboard.": "Количество безошибочных нажатий клавиш в уроке прежде чем можно будет подключать клавиши из уже пройденных уроков.",
  "KeyboardPage\u0004Count of generated words in one training session.": "Количество генерированных слов для каждого занятия.",
  "KeyboardPage\u0004Count of strokes that will be deducted from the total key strokes for every error in this key during training.": "Количество нажатий, которое будет вычтено из всех нажатий клавиши за каждую ошибку во время тренировки.",
  "KeyboardPage\u0004Error Penalty": "Штраф за ошибку",
  "KeyboardPage\u0004Errors penalty configuration.": "Настройки штрафа за ошибку.",
  "KeyboardPage\u0004Extra Strokes:": "Доп. нажатия:",
  "KeyboardPage\u0004In training metronome configuration.": "Настройки метронома для занятий.",
  "KeyboardPage\u0004Initial:": "Введение:",
  "KeyboardPage\u0004Lesson:": "Урок:",
  "KeyboardPage\u0004Metronome": "Метроном",
  "KeyboardPage\u0004Metronome ticks volume percentage.": "Громкость щелчков метронома в процентах.",
  "KeyboardPage\u0004More Stats": "Больше статистики",
  "KeyboardPage\u0004One word length configuration. Minimal and maximal lengths.": "Настройки длины одного слова. Минимальное и максимальное количество знаков в слове.",
  "KeyboardPage\u0004Start Training": "Начать занятие",
  "KeyboardPage\u0004Strokes": "Нажатия",
  "KeyboardPage\u0004Tempo:": "Темп:",
  "KeyboardPage\u0004Text Generator": "Генератор текста занятия",
  "KeyboardPage\u0004Ticks per minute metronome tempo.": "Количество щелчков в минуту метронома.",
  "KeyboardPage\u0004to:": "до:",
  "KeyboardPage\u0004Training text generating algorithms configuration.": "Настройки алгоритма подбора текста для занятия.",
  "KeyboardPage\u0004Volume:": "Громкость:",
  "KeyboardPage\u0004Welcome, %1": "Добро пожаловать, %1",
  "KeyboardPage\u0004Word Length from:": "Длина слова от:",
  "KeyboardPage\u0004Words:": "Всего слов:",
  "LessonLabel\u0004Lesson %1.": "Урок №%1.",
  "LoginPage\u0004Go": "Поехали",
  "LoginPage\u0004Please type your name, so I know how to address to you": "Пожалуйста, представьтесь, чтобы к Вам можно было обращаться",
  "LoginPage\u0004Welcome to kb-trainer": "Добро пожаловать в клавиатурный тренажёр kb-trainer",
  "Logo\u0004kb-trainer": "kb-trainer",
  "Menu\u0004Buy me some tea...": "На чай…",
  "Menu\u0004Keyboards": "Клавиатуры",
  "MyKeyboard\u0004keys:": "клавиш:",
  "OtherKeyboard\u0004keys:": "клавиш:",
  "PracticePage\u0004Cancel Training": "Отменить занятие",
  "PracticePage\u0004Pause": "Пауза",
  "PracticePage\u0004Restart Lesson": "Перезапустить урок",
  "PracticePage\u0004Stop Training": "Остановить занятие",
  "StatsChart\u0004Errors": "Ошибки",
  "StatsChart\u0004Strokes": "Нажатия",
  "StatsPage\u0004Back to Keyboard": "Вернуться к Клавиатуре",
  "SummaryChart\u0004Last session": "Последнее занятие",
  "SummaryChart\u0004Strokes": "Нажатия",
  "SummaryChart\u0004Total": "Всего",
  "Trainer\u0004Hot streak: %1": "Полоса везения: %1",
  "Trainer\u0004Hot streak: %1 / %2": "Полоса везения: %1 / %2",
  "Trainer\u0004keyboard:": "клавиатура:",
  "Trainer\u0004Metronome Tempo: %1": "Метроном Темп: %1",
  "Trainer\u0004Paused. ": "На паузе. ",
  "TrainerInstruction\u0004Make sure you have proper keyboard layout selected. Find required keys on keyboard and place your hands in proper position. Prepare to start.": "Убедитесь, что выбрана верная раскладка. Найдите требуемые клавиши на клавиатуре и разместите руки в стартовую позицию. Приготовьтесь начать.",
  "TrainerInstruction\u0004Press space bar to start": "Нажмите пробел, чтобы начать занятие",
  "TrainerLine\u0004Chars: %1 / %2": "Знаков: %1 / %2",
  "TrainerLine\u0004Cpm: %1": "Зн/мин: %1",
  "TrainerLine\u0004Errors: %1 (%2%%)": "Ошибок: %1 (%2%%)",
  "TrainerLine\u0004Time: %1": "Время: %1",
  "UserPage\u0004Available keyboards": "Доступные клавиатуры",
  "UserPage\u0004My keyboards progress": "Мой прогресс"
}