Repository: smeagol74/kb-trainer
Catalog: i18n/messages.*.po
Languages: ru

# AboutPage
source: Start
ru: Поехали

# HomePage
source: section_concept
ru: <h2>Концепция</h2> <p>Задача этого тренажёра — предоставить возможность пользователю ознакомиться со своей клавиатурой. Он не навязывает вам никакой определённой концепции набора. В этом смысле он подходит как тем, кто желает набирать исключительно двумя пальцами, так и гостям с Альфа Центавра, с десятью пальцами на каждой из их трёх рук :)</p> <p>Чтобы привыкнуть к любой клавиатуре — необходимо нажать каждую клавишу некоторое количество раз, сознательно обращая своё внимание на это, чтобы руки «запомнили» её расположение на клавиатуре и впоследствии действовали на автомате.</p> <p>Тренажёр должен быть универсальным. Позволять тренироваться с любой клавиатурной раскладкой, любого языка на любой клавиатуре с любым расположением клавиш и по любой методике.</p>

# HomePage
source: section_congratulations
ru: <p>Удачи! Все <a href="https://github.com/smeagol74/kb-trainer/discussions" target="_blank" rel="noreferrer nofollow">пожелания</a>/<a href="https://github.com/smeagol74/kb-trainer/issues" target="_blank" rel="noreferrer nofollow">замечания</a>/<a href="https://github.com/smeagol74/kb-trainer/discussions" target="_blank" rel="noreferrer nofollow">предложения</a> оставляйте на Гитхабе.</p> <p><a href="https://github.com/smeagol74/kb-trainer/pulls" target="_blank" rel="noreferrer nofollow">Пул-реквесты</a> тоже приветствуются.</p>

# HomePage
source: section_createdFor
ru: <h2>Для кого этот тренажёр создан</h2> <p>Он создан для всех, кто желает научиться более эффективно использовать свою клавиатуру. Кому приходится набирать много текстов, использовать много комбинаций клавиш. Со всеми её клавишами, включая клавиши переключатели (Shift, Control, Alt), клавиши перемещения и функциональные.</p> <p>Тренажёр ничего не знает про конфигурацию вашей клавиатуры или тренируемую раскладку, будь то классический ЙЦУКЕН или какой-нибудь специфический Бирман. Тренажёр подходит для любых вариантов.</p>

# HomePage
source: section_history
ru: <h2>История идеи</h2> <p>Осенью 2020 года любимая жена подарила мне новую замечательную клавиатуру, вот такую:&nbsp;<a href="https://kinesis-ergo.com/shop/advantage2/" target="_blank" rel="noreferrer nofollow">Kinesis Advantage 2</a> и тут незамедлительно выяснилось, что я не умею на ней работать. Буковки-то я ещё вспомнил как набирать, благо, метод слепой печати я освоил в своё время, но вот всё остальное оказалось очень сильно не на своих местах, Что уронило мою продуктивность практически в ноль. Я вновь ощутил себя человеком севшим за клавиатуру впервые в жизни. Так как я уже тренировался слепой печати, то решил просто обновить свои навыки на новой клавиатуре пройдя какой-нибудь известный курс. Нашёл какой-то тренажёр и даже начал нажимать буковки, но тут я понял, что тренажёр совершенно не занимается всякими служебными кнопочками. Тогда стал искать другие тренажёры и перепробовал многие, но результат был тот же. Пробел с вводом и переключатель строчных/прописных букв ещё как-то учитываются всеми этими многочисленными курсами, но множество прочих переключателей и расширенных знаков полностью игнорированы. Все обнаруженные мной тренажёры позволяют научиться набирать буковки, циферки и немного пунктуации. Но этого мало. И я задумал создать тренажёр, который позволит натренировать руки пользоваться всей клавиатурой целиком. Ведь кнопки Ввода, Контрола или Альта ничем не отличаются от кнопок с буковками. Из этого родилась концепция…</p>

# HomePage
source: section_howItWorks
ru: <h2>Как это работает</h2> <p>Устройство тренажёра вытекает из основных принципов.</p> <ul> <li>Все символы/клавиши разбиты на группы, которые называются «Клавиатурами». Вы можете тренировать различные клавиатуры независимо друг от друга.</li> <li>Клавиатуры бывают пакетными и содержат символы/клавиши из другию «клавиатур», например пакетная клавиатура «English» содержит в себе все английские знаки, цифры, пунктуацию и специальные клавиши.</li> <li>Тренировка «Клавиатуры» разбита на «уроки», которые тренируют какой-то набор символов/клавиш.</li> <li>Каждый «Урок» сначала тренирует только символы/клавиши этого урока (до определённого уровня), а затем подключает все уже пройденные уроки.</li> <li>Для тренировки урока, алгоритм случайным образом формирует текст тренировки учитывая всю предыдущую историю тренировок этой клавиатуры. Если во время тренировки вы сделали ошибку, то в последующих тренировка будет необходимо компенсировать её набрав ошибочный символ ещё заданное количество раз. Алгоритм старается добавлять символы/клавиши в текст так, чтобы вы нажимали их все примерно одинаково.</li> <li>Когда все уроки «пройдены», вы «застрянете» на последнем уроке с текстами состоящими из всех символов клавиатуры, пока не наберёте каждый символ заданное количество раз. За каждую ошибку от уже набранного количества будет отниматься заданное в настройках число. Чем больше вы делаете ошибок, тем больше будет попадаться ошибочный символ/клавиша в генерируемых текстах. Одновременно с этим тренажёр переключится в режим повышения скорости набора. Автомат будет увеличивать скорость при безошичном прохождении уроков и уменьшать её в случае появления ошибок.</li> </ul>

# HomePage
source: section_plans
ru: <h2>P.S. Планы</h2> <p>Вообще идей много. Хочется сделать возможность тренировки горячих клавиш. Причём как обычных клавиатурных аккордов, так и арпеджио, как в Vim или Emacs. Добавить возможность пользователям создавать свои собственные клавиатуры. Боюсь, что всякие диактитические знаки европейских языков приклеивающиеся к обычным английским символам сходу могут не заработать. Чего делать с восточными языками вроде китайского/японского вообще пока не понятно.</p> <p>Ещё я заметил, что мне интереснее тренироваться не под стук метронома, а под музыку. Например, диско даёт отличный ритм в диапазоне 100-130 ударов в минуту. И есть идея вместо метронома сделать диско-микс с возможностью плавной регулировки частоты ритма. Может синтезированная музыка подойдёт, пока не знаю.</p>

# HomePage
source: section_principles
ru: <h2>Основные принципы</h2> <ul> <li>Чтобы привыкнуть к расположению клавиши, её нужно нажать много раз.</li> <li>Нажимать клавиши лучше без ошибок в удобном равномерном темпе.</li> <li>Развивать скорость нужно отдельно, когда пальцы привыкли к расположению клавиш.</li> <li>При нажатии комбинаций лучше по возможности использовать разные руки. Например, набирая заглавную букву клавишу <kbd>Shift</kbd> лучше нажимать другой рукой, чем буквенную клавишу.</li> </ul>

# HomePage
source: section_specifics
ru: <h2>Специфика этого тренажёра</h2> <p>Этот тренажёр отличается от прочих тем, что позволяет тренировать и привыкать к расположению не только буквенно-цифровых знаков какой-то определённой раскладки и нескольких самых основных знаков препинания, но любых клавиш на вашей клавиатуре.</p>

# HomePage
source: Start
ru: Поехали

# KeyboardPage
source: Complete:
ru: Завершение:

# KeyboardPage
source: Configuration of training completion and lessons switch criteria.
ru: Настройка завершения тренировок и критерия переключения уроков.

# KeyboardPage
source: Count of errorless strokes of each key in the keyboard to consider keyboard training complete.
ru: Количество безошибочных нажатий каждой клавиши в клавиатуре, чтобы считать её натренированной.

# KeyboardPage
source: Count of errorless strokes of each key in the lesson to consider the lesson is done and user can move forward.
ru: Количество безошибочных нажатий каждой клавиши в уроке, чтобы считать, что урок завершён и можно двигаться дальше.

# KeyboardPage
source: Count of errorless strokes of keys in the lesson before adding already trained keys of keyboard.
ru: Количество безошибочных нажатий клавиш в уроке прежде чем можно будет подключать клавиши из уже пройденных уроков.

# KeyboardPage
source: Count of generated words in one training session.
ru: Количество генерированных слов для каждого занятия.

# KeyboardPage
source: Count of strokes that will be deducted from the total key strokes for every error in this key during training.
ru: Количество нажатий, которое будет вычтено из всех нажатий клавиши за каждую ошибку во время тренировки.

# KeyboardPage
source: Error Penalty
ru: Штраф за ошибку

# KeyboardPage
source: Errors penalty configuration.
ru: Настройки штрафа за ошибку.

# KeyboardPage
source: Extra Strokes:
ru: Доп. нажатия:

# KeyboardPage
source: In training metronome configuration.
ru: Настройки метронома для занятий.

# KeyboardPage
source: Initial:
ru: Введение:

# KeyboardPage
source: Lesson:
ru: Урок:

# KeyboardPage
source: Metronome
ru: Метроном

# KeyboardPage
source: Metronome ticks volume percentage.
ru: Громкость щелчков метронома в процентах.

# KeyboardPage
source: More Stats
ru: Больше статистики

# KeyboardPage
source: One word length configuration. Minimal and maximal lengths.
ru: Настройки длины одного слова. Минимальное и максимальное количество знаков в слове.

# KeyboardPage
source: Start Training
ru: Начать занятие

# KeyboardPage
source: Strokes
ru: Нажатия

# KeyboardPage
source: Tempo:
ru: Темп:

# KeyboardPage
source: Text Generator
ru: Генератор текста занятия

# KeyboardPage
source: Ticks per minute metronome tempo.
ru: Количество щелчков в минуту метронома.

# KeyboardPage
source: to:
ru: до:

# KeyboardPage
source: Training text generating algorithms configuration.
ru: Настройки алгоритма подбора текста для занятия.

# KeyboardPage
source: Volume:
ru: Громкость:

# KeyboardPage
source: Welcome, %1
ru: Добро пожаловать, %1

# KeyboardPage
source: Word Length from:
ru: Длина слова от:

# KeyboardPage
source: Words:
ru: Всего слов:

# LessonLabel
source: Lesson %1.
ru: Урок №%1.

# LoginPage
source: Go
ru: Поехали

# LoginPage
source: Please type your name, so I know how to address to you
ru: Пожалуйста, представьтесь, чтобы к Вам можно было обращаться

# LoginPage
source: Welcome to kb-trainer
ru: Добро пожаловать в клавиатурный тренажёр kb-trainer

# Menu
source: Buy me some tea...
ru: На чай…

# Menu
source: Keyboards
ru: Клавиатуры

# MyKeyboard
source: keys:
ru: клавиш:

# OtherKeyboard
source: keys:
ru: клавиш:

# PracticePage
source: Cancel Training
ru: Отменить занятие

# PracticePage
source: Pause
ru: Пауза

# PracticePage
source: Restart Lesson
ru: Перезапустить урок

# PracticePage
source: Stop Training
ru: Остановить занятие

# StatsChart
source: Errors
ru: Ошибки

# StatsChart
source: Strokes
ru: Нажатия

# StatsPage
source: Back to Keyboard
ru: Вернуться к Клавиатуре

# SummaryChart
source: Last session
ru: Последнее занятие

# SummaryChart
source: Strokes
ru: Нажатия

# SummaryChart
source: Total
ru: Всего

# Trainer
source: Hot streak: %1
ru: Полоса везения: %1

# Trainer
source: Hot streak: %1 / %2
ru: Полоса везения: %1 / %2

# Trainer
source: keyboard:
ru: клавиатура:

# Trainer
source: Metronome Tempo: %1
ru: Метроном Темп: %1

# Trainer
source: Paused.
ru: На паузе.

# TrainerInstruction
source: Make sure you have proper keyboard layout selected. Find required keys on keyboard and place your hands in proper position. Prepare to start.
ru: Убедитесь, что выбрана верная раскладка. Найдите требуемые клавиши на клавиатуре и разместите руки в стартовую позицию. Приготовьтесь начать.

# TrainerInstruction
source: Press space bar to start
ru: Нажмите пробел, чтобы начать занятие

# TrainerLine
source: Chars: %1 / %2
ru: Знаков: %1 / %2

# TrainerLine
source: Cpm: %1
ru: Зн/мин: %1

# TrainerLine
source: Errors: %1 (%2%%)
ru: Ошибок: %1 (%2%%)

# TrainerLine
source: Time: %1
ru: Время: %1

# UserPage
source: Available keyboards
ru: Доступные клавиатуры

# UserPage
source: My keyboards progress
ru: Мой прогресс
